ybyllc/stm32-tea-lib/2_Control/menu.c
    // 显示提示
    OLED_ShowString(0, 7, "Press keys!", 12);

    OLED_Refresh();
}

/**
 * @brief 显示电机测试页面
 */
static void Menu_DisplayMotorTestPage(void) {
    OLED_Clear(0);
    
    // 首次进入时初始化电机
    if (!motor_initialized) {
        Menu_InitMotor();
    }
    
    char str[20];
    
    // 前左电机
    if (current_motor_index == 0) {
        OLED_ShowString(0, 0, ">", 16);
        OLED_ShowString(20, 0, "FL:", 16);
        sprintf(str, "%4d", motor_speeds[0]);
        if (motor_speed_adjust_mode && current_motor_index == 0) {
            // 速度调整模式下，反色显示速度数字
            OLED_ShowString_Reverse(52, 0, str, 16);
        } else {
            OLED_ShowString(52, 0, str, 16);
        }
    } else {
        OLED_ShowString(20, 0, "FL:", 16);
        sprintf(str, "%4d", motor_speeds[0]);
        OLED_ShowString(52, 0, str, 16);
    }
    
    // 前右电机
    if (current_motor_index == 1) {
        OLED_ShowString(0, 2, ">", 16);
        OLED_ShowString(20, 2, "FR:", 16);
        sprintf(str, "%4d", motor_speeds[1]);
        if (motor_speed_adjust_mode && current_motor_index == 1) {
            // 速度调整模式下，反色显示速度数字
            OLED_ShowString_Reverse(52, 2, str, 16);
        } else {
            OLED_ShowString(52, 2, str, 16);
        }
    } else {
        OLED_ShowString(20, 2, "FR:", 16);
        sprintf(str, "%4d", motor_speeds[1]);
        OLED_ShowString(52, 2, str, 16);
    }
    
    // 后左电机
    if (current_motor_index == 2) {
        OLED_ShowString(0, 4, ">", 16);
        OLED_ShowString(20, 4, "BL:", 16);
        sprintf(str, "%4d", motor_speeds[2]);
        if (motor_speed_adjust_mode && current_motor_index == 2) {
            // 速度调整模式下，反色显示速度数字
            OLED_ShowString_Reverse(52, 4, str, 16);
        } else {
            OLED_ShowString(52, 4, str, 16);
        }
    } else {
        OLED_ShowString(20, 4, "BL:", 16);
        sprintf(str, "%4d", motor_speeds[2]);
        OLED_ShowString(52, 4, str, 16);
    }
    
    // 后右电机
    if (current_motor_index == 3) {
        OLED_ShowString(0, 6, ">", 16);
        OLED_ShowString(20, 6, "BR:", 16);
        sprintf(str, "%4d", motor_speeds[3]);
        if (motor_speed_adjust_mode && current_motor_index == 3) {
            // 速度调整模式下，反色显示速度数字
            OLED_ShowString_Reverse(52, 6, str, 16);
        } else {
            OLED_ShowString(52, 6, str, 16);
        }
    } else {
        OLED_ShowString(20, 6, "BR:", 16);
        sprintf(str, "%4d", motor_speeds[3]);
        OLED_ShowString(52, 6, str, 16);
    }
    
    OLED_Refresh();
}

/**
 * @brief 显示编码器测试页面
 */
static void Menu_DisplayEncoderTestPage(void) {
    OLED_Clear(0);
    
    // 显示标题
    OLED_ShowString(0, 0, "Encoder Test", 16);
    
    // 初始化编码器（电机编码器，使用TIM2和TIM5）
    static uint8_t encoder_initialized = 0;
    if (!encoder_initialized) {
        Encoder_Init();
        encoder_initialized = 1;
    }
    
    // 更新编码器累计值
    encoder1_total_count += Encoder_GetCount(ENCODER_1);
    encoder2_total_count += Encoder_GetCount(ENCODER_2);
    
    // 显示编码器累计值
    char str[20];
    sprintf(str, "Enc1:%6d", encoder1_total_count);
    OLED_ShowString(0, 2, str, 16);
    
    sprintf(str, "Enc2:%6d", encoder2_total_count);
    OLED_ShowString(0, 4, str, 16);
    
    // 显示提示信息
    OLED_ShowString(0, 6, "Turn the motors", 12);
    
    OLED_Refresh();
}

/**
 * @brief 显示ADC测试页面
 */
static void Menu_DisplayAdcTestPage(void) {
    OLED_Clear(0);
    
    // 显示标题
    OLED_ShowString(0, 0, "ADC Test", 16);
    
    // 首次进入时初始化ADC
    if (!adc_initialized) {
        Menu_InitAdc();
    }
    
    // 启动ADC转换
    HAL_ADC_Start(&hadc1);
    
    // 等待转换完成
    HAL_ADC_PollForConversion(&hadc1, 100);
    
    // 读取ADC值
    uint32_t adc_value = HAL_ADC_GetValue(&hadc1);
    
    // 停止ADC
    HAL_ADC_Stop(&hadc1);
    
    // 转换为电压值（V）
    float voltage = (float)adc_value * 3.3f / 4095.0f;
    
    // 显示电压值
    char str[20];
    sprintf(str, "Voltage:%.2f V", voltage);
    OLED_ShowString(0, 2, str, 16);
    
    // 显示ADC原始值
    sprintf(str, "ADC Value:%4u", adc_value);
    OLED_ShowString(0, 4, str, 16);
    
    // 显示提示信息
    OLED_ShowString(0, 6, "PC4 as ADC input", 12);
    
    OLED_Refresh();
}

// PS2手柄数据结构
static JOYSTICK_TypeDef ps2_joystick;

/**
 * @brief 显示PS2手柄测试页面
 * @note 使用ax_ps2驱动，只显示按键值
 */
static void Menu_DisplayPS2TestPage(void) {
    OLED_Clear(0);
    
    // 首次进入时初始化PS2
    if (!ps2_initialized) {
        Menu_InitPS2();
    }
    
    // 按键震动反馈状态
    static uint8_t last_btn1 = 0xFF;
    static uint8_t last_btn2 = 0xFF;
    static uint32_t vibration_start_time = 0;
    static uint8_t is_vibrating = 0;
    static uint8_t motor1 = 0;
    static uint8_t motor2 = 0;
    
    // 检测按键变化
    if ((ps2_joystick.btn1 != last_btn1) || (ps2_joystick.btn2 != last_btn2)) {
        // 有按键按下时震动
        if ((ps2_joystick.btn1 != 0xFF) || (ps2_joystick.btn2 != 0xFF)) {
            motor1 = 0xFF;  // 大电机全速
            motor2 = 0x01;  // 小电机开启
            vibration_start_time = HAL_GetTick();
            is_vibrating = 1;
        }
    }
    
    // 震动持续100ms后关闭
    if (is_vibrating && (HAL_GetTick() - vibration_start_time > 100)) {
        motor1 = 0x00;  // 关闭大电机
        motor2 = 0x00;  // 关闭小电机
        is_vibrating = 0;
    }
    
    last_btn1 = ps2_joystick.btn1;
    last_btn2 = ps2_joystick.btn2;
    
    // 读取PS2数据（带震动）
    AX_PS2_ScanKeyVibration(&ps2_joystick, motor1, motor2);
    
    // 显示模式和原始键值 (12号字体，第0行)
    char str[20];
    sprintf(str, "M:%02X B1:%02X B2:%02X", ps2_joystick.mode, ps2_joystick.btn1, ps2_joystick.btn2);
    OLED_ShowString(0, 0, str, 12);
    
    // 显示右摇杆数值 (第1行)
    sprintf(str, "RX:%3d RY:%3d", ps2_joystick.RJoy_LR, ps2_joystick.RJoy_UD);
    OLED_ShowString(0, 1, str, 12);
    
    // 显示左摇杆数值 (第2行)
    sprintf(str, "LX:%3d LY:%3d", ps2_joystick.LJoy_LR, ps2_joystick.LJoy_UD);
    OLED_ShowString(0, 2, str, 12);
    
    // 显示方向键状态 (第3行)
    // btn1: B0:SLCT B1:JR  B2:JL B3:STRT B4:UP B5:R B6:DOWN B7:L
    OLED_ShowString(0, 3, "DPad:", 12);
    if (ps2_joystick.btn1 & 0x10) OLED_ShowString(36, 3, "U", 12);
    else OLED_ShowString(36, 3, "-", 12);
    if (ps2_joystick.btn1 & 0x40) OLED_ShowString(48, 3, "D", 12);
    else OLED_ShowString(48, 3, "-", 12);
    if (ps2_joystick.btn1 & 0x80) OLED_ShowString(60, 3, "L", 12);
    else OLED_ShowString(60, 3, "-", 12);
    if (ps2_joystick.btn1 & 0x20) OLED_ShowString(72, 3, "R", 12);
    else OLED_ShowString(72, 3, "-", 12);
    
    // 显示按键状态 (第4行)
    // btn2: B0:L2 B1:R2 B2:L1 B3:R1 B4:Y B5:B B6:A B7:X
    OLED_ShowString(0, 4, "Key:", 12);
    if (ps2_joystick.btn2 & 0x10) OLED_ShowString(30, 4, "Y", 12);
    else OLED_ShowString(30, 4, "-", 12);
    if (ps2_joystick.btn2 & 0x20) OLED_ShowString(42, 4, "B", 12);
    else OLED_ShowString(42, 4, "-", 12);
    if (ps2_joystick.btn2 & 0x40) OLED_ShowString(54, 4, "A", 12);
    else OLED_ShowString(54, 4, "-", 12);
    if (ps2_joystick.btn2 & 0x80) OLED_ShowString(66, 4, "X", 12);
    else OLED_ShowString(66, 4, "-", 12);
    
    // 显示肩键 (第5行) - 顺序：L1 L2 R1 R2
    // btn2: B0:L2   B1:R2  B2:L1  B3:R1
    OLED_ShowString(0, 5, "L1:", 12);
    OLED_ShowString(21, 5, (ps2_joystick.btn2 & 0x04) ? "1" : "0", 12);
    OLED_ShowString(36, 5, "L2:", 12);
    OLED_ShowString(57, 5, (ps2_joystick.btn2 & 0x01) ? "1" : "0", 12);
    OLED_ShowString(69, 5, "R1:", 12);
    OLED_ShowString(90, 5, (ps2_joystick.btn2 & 0x08) ? "1" : "0", 12);
    OLED_ShowString(102, 5, "R2:", 12);
    OLED_ShowString(123, 5, (ps2_joystick.btn2 & 0x02) ? "1" : "0", 12);
    
    // 显示摇杆按下按键 (第6行) - 顺序：JR JL ST SL
    // btn1: B0:SLCT B1:JR  B2:JL B3:STRT
    OLED_ShowString(0, 6, "JR:", 12);
    OLED_ShowString(24, 6, (ps2_joystick.btn1 & 0x02) ? "1" : "0", 12);
    OLED_ShowString(36, 6, "JL:", 12);
    OLED_ShowString(60, 6, (ps2_joystick.btn1 & 0x04) ? "1" : "0", 12);
    OLED_ShowString(72, 6, "ST:", 12);
    OLED_ShowString(96, 6, (ps2_joystick.btn1 & 0x08) ? "1" : "0", 12);
    OLED_ShowString(108, 6, "SL:", 12);
    OLED_ShowString(120, 6, (ps2_joystick.btn1 & 0x01) ? "1" : "0", 12);
    
    OLED_Refresh();
}

/**
 * @brief 显示PS2控制模式页面
 * @note 使用PS2手柄摇杆控制PWM输出（航模PWM模式：50Hz，1000-2000us）
 *       左摇杆Y->B1, 左摇杆X->B0, 右摇杆Y->A7, 右摇杆X->A6
 */
static void Menu_DisplayPS2ControlPage(void) {
    static MenuPageType last_page = MENU_PAGE_MAIN;
    static uint8_t servo_initialized = 0;
    
    // 检测页面切换（从 PS2_CONTROL 切换到其他页面）
    if (last_page == MENU_PAGE_PS2_CONTROL && menuState.currentPage != MENU_PAGE_PS2_CONTROL) {
        Servo_Pwm_StopAll();
    }
    last_page = menuState.currentPage;
    
