ybyllc/stm32-tea-lib/2_Control/menu.c
    // 计算滚动偏移量
    uint8_t scroll_offset = 0;
    if (menuState.currentItem >= MAX_VISIBLE_ITEMS) {
        scroll_offset = menuState.currentItem - MAX_VISIBLE_ITEMS + 1;
    }
    
    // 垂直行布局，每个菜单项占一行，16字大小
    for (uint8_t i = 0; i < MAIN_MENU_ITEM_COUNT; i++) {
        // 只显示在可见范围内的菜单项
        if (i >= scroll_offset && i < scroll_offset + MAX_VISIBLE_ITEMS) {
            uint8_t display_row = i - scroll_offset;
            if (i == menuState.currentItem) {
                // 显示选中的菜单项（带方框标记）
                OLED_ShowString(0, display_row * 2, "[", 16);
                OLED_ShowString(12, display_row * 2, mainMenuItems[i].name, 16);
                OLED_ShowString(112, display_row * 2, "]", 16);
            } else {
                // 显示未选中的菜单项
                OLED_ShowString(12, display_row * 2, mainMenuItems[i].name, 16);
            }
        }
    }
    
    OLED_Refresh();
}

/**
 * @brief 显示当前页面
 */
static void Menu_DisplayCurrentPage(void) {
    switch (menuState.currentPage) {
        case MENU_PAGE_MAIN:
            Menu_DisplayMainMenu();
            break;
        case MENU_PAGE_GYRO:
            Menu_DisplayGyroPage();
            break;
        case MENU_PAGE_EC11_TEST:
            Menu_DisplayEc11TestPage();
            break;
        case MENU_PAGE_TOF_TEST:
            Menu_DisplayTofTestPage();
            break;
        case MENU_PAGE_REMOTE_KEY_TEST:
            Menu_DisplayRemoteKeyTestPage();
            break;
        case MENU_PAGE_MOTOR_TEST:
            Menu_DisplayMotorTestPage();
            break;
        case MENU_PAGE_ENCODER_TEST:
            Menu_DisplayEncoderTestPage();
            break;
        case MENU_PAGE_ADC_TEST:
            Menu_DisplayAdcTestPage();
            break;
        case MENU_PAGE_PS2_TEST:
            Menu_DisplayPS2TestPage();
            break;
        case MENU_PAGE_PS2_CONTROL:
            Menu_DisplayPS2ControlPage();
            break;
        case MENU_PAGE_SERVO_PWM:
            Menu_DisplayServoPWMPage();
            break;
        case MENU_PAGE_GPIO_TEST:
            Menu_DisplayGPIOTestPage();
            break;
        default:
            Menu_DisplayMainMenu();
            break;
    }
}
